[M_HomeMovies MissionDefinition]
MissionDescription="Lilith wants you to hijack Hyperion's dishonest tourism propaganda and replace it with something a little more truthful. And violent."
TurnInDescription="You've convinced the rest of the universe that Jack's big, shiny city is actually a big, shiny deathtrap. You also touched Moxxi's camera, which means you should probably wash your hands. With acid."

[M_HomeMovies:KillEngineers MissionObjectiveDefinition]
ProgressMessage="Kill engineers"
